# ResList_GetSelIsDoc

## Description
Return if the selected resource is in the current document. The 'uniqueID' is a string identifier uniquely identifying this control.

```pascal
FUNCTION ResList_GetSelIsDoc(uniqueID : STRING) : BOOLEAN;
```

```python

def vs.ResList_GetSelIsDoc(uniqueID):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|uniqueID|STRING||

## Version
Availability: from Vectorworks 2017
## Category
* Document List Handling